chore: add go doc for pkg, cmd and platform dirs
